#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.infra_output: Reading...
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
aws_iam_role.codedeploy: Refreshing state... [id=app-6-code-deploy-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
data.aws_iam_policy_document.codedeploy: Reading...
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
aws_iam_role_policy.codedeploy: Refreshing state... [id=app-6-code-deploy-role:terraform-20241003165455650800000001]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=64052ff7b7e2398c9ab49615e5ea5caf6be76b0c]
terraform_data.code_deploy: Refreshing state... [id=98b9d828-ac68-027f-70f4-e2d26ad55e99]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.code_deploy_sh has been deleted
  - resource "local_file" "code_deploy_sh" {
      - content              = <<-EOT
            #!/bin/bash
                echo "Starting CodeDeploy agent deployment"
                ID=$(aws deploy create-deployment \
                    --application-name app-6 \
                    --deployment-config-name CodeDeployDefault.OneAtATime \
                    --deployment-group-name app-6-deploy-group \
                    --appspec-content file://appspec.json \
                    --description "Deployment from Terraform" \
                    --output json | jq -r '.deploymentId')
                echo "waiting for deployment to complete"
                STATUS=$(aws deploy get-deployment \
                  --deployment-id $ID \
                  --output json | jq -r '.deploymentInfo.status')
                while [ "$STATUS" == "Created" || "$STATUS" == "InProgress" || "$STATUS" == "Pending" || "$STATUS" == "Queued" || "$STATUS" == "Ready" ||]; do
                    echo "Deployment status: $STATUS"
                    STATUS=$(aws deploy get-deployment \
                        --deployment-id $ID \
                        --output json | jq -r '.deploymentInfo.status')
                    echo "waiting for 30 seconds."
                    sleep 30
                done
                if [ "$STATUS" == "Succeeded" ]; then
                    echo "Deployment $ID succeeded"
                else
                    echo "Deployment $ID failed"
                    exit 1
                fi
        EOT -> null
      - content_base64sha256 = "2xIpgMQgPkuWFkt6mKIFVJ9EIyPgMblX7RlwLq+lJ6A=" -> null
      - content_base64sha512 = "I5UV9rd/n8ksG9iVfbN4SnQ42aarxjHShi39AkVW/XxaKRfjuHv4OAvKRQ7GmYrfySvPaXw315oZYA81DjedvQ==" -> null
      - content_md5          = "0520673090dfd2ce05cb6f588fd68806" -> null
      - content_sha1         = "64052ff7b7e2398c9ab49615e5ea5caf6be76b0c" -> null
      - content_sha256       = "db122980c4203e4b96164b7a98a205549f442323e031b957ed19702eafa527a0" -> null
      - content_sha512       = "239515f6b77f9fc92c1bd8957db3784a7438d9a6abc631d2862dfd024556fd7c5a2917e3b87bf8380bca450ec6998adfc92bcf697c37d79a19600f350e379dbd" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./code_deploy.sh" -> null
      - id                   = "64052ff7b7e2398c9ab49615e5ea5caf6be76b0c" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:32" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 32 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = <<-EOT
            #!/bin/bash
                echo "Starting CodeDeploy agent deployment"
                ID=$(aws deploy create-deployment \
                    --application-name app-6 \
                    --deployment-config-name CodeDeployDefault.OneAtATime \
                    --deployment-group-name app-6-deploy-group \
                    --appspec-content file://appspec.json \
                    --description "Deployment from Terraform" \
                    --output json | jq -r '.deploymentId')
                echo "waiting for deployment to complete"
                STATUS=$(aws deploy get-deployment \
                  --deployment-id $ID \
                  --output json | jq -r '.deploymentInfo.status')
                while [ "$STATUS" == "Created" || "$STATUS" == "InProgress" || "$STATUS" == "Pending" || "$STATUS" == "Queued" || "$STATUS" == "Ready" ||]; do
                    echo "Deployment status: $STATUS"
                    STATUS=$(aws deploy get-deployment \
                        --deployment-id $ID \
                        --output json | jq -r '.deploymentInfo.status')
                    echo "waiting for 30 seconds."
                    sleep 30
                done
                if [ "$STATUS" == "Succeeded" ]; then
                    echo "Deployment $ID succeeded"
                else
                    echo "Deployment $ID failed"
                    exit 1
                fi
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # terraform_data.code_deploy is tainted, so must be replaced
-/+ resource "terraform_data" "code_deploy" {
      ~ id               = "98b9d828-ac68-027f-70f4-e2d26ad55e99" -> (known after apply)
      ~ input            = "e92bb87150d9b6baea7720e3bddf023aac0feaba7ce41749055210a6a910372b" -> (known after apply)
      ~ output           = "e92bb87150d9b6baea7720e3bddf023aac0feaba7ce41749055210a6a910372b" -> (known after apply)
      ~ triggers_replace = {
          ~ content              = <<-EOT
              - #!/bin/bash
              + #!/bin/bash
              -     echo "Starting CodeDeploy agent deployment"
              +     echo "Starting CodeDeploy agent deployment"
              -     ID=$(aws deploy create-deployment \
              +     ID=$(aws deploy create-deployment \
              -         --application-name app-6 \
              +         --application-name app-6 \
              -         --deployment-config-name CodeDeployDefault.OneAtATime \
              +         --deployment-config-name CodeDeployDefault.OneAtATime \
              -         --deployment-group-name app-6-deploy-group \
              +         --deployment-group-name app-6-deploy-group \
              -         --appspec-content file://appspec.json \
              +         --appspec-content file://appspec.json \
              -         --description "Deployment from Terraform" \
              +         --description "Deployment from Terraform" \
              -         --output json | jq -r '.deploymentId')
              +         --output json | jq -r '.deploymentId')
              -     echo "waiting for deployment to complete"
              +     echo "waiting for deployment to complete"
              -     STATUS=$(aws deploy get-deployment \
              +     STATUS=$(aws deploy get-deployment \
              -       --deployment-id $ID \
              +       --deployment-id $ID \
              -       --output json | jq -r '.deploymentInfo.status')
              +       --output json | jq -r '.deploymentInfo.status')
              -     while [ "$STATUS" == "Created" || "$STATUS" == "InProgress" || "$STATUS" == "Pending" || "$STATUS" == "Queued" || "$STATUS" == "Ready" ||]; do
              +     while [ "$STATUS" == "Created" || "$STATUS" == "InProgress" || "$STATUS" == "Pending" || "$STATUS" == "Queued" || "$STATUS" == "Ready" ||]; do
              -         echo "Deployment status: $STATUS"
              +         echo "Deployment status: $STATUS"
              -         STATUS=$(aws deploy get-deployment \
              +         STATUS=$(aws deploy get-deployment \
              -             --deployment-id $ID \
              +             --deployment-id $ID \
              -             --output json | jq -r '.deploymentInfo.status')
              +             --output json | jq -r '.deploymentInfo.status')
              -         echo "waiting for 30 seconds."
              +         echo "waiting for 30 seconds."
              -         sleep 30
              +         sleep 30
              -     done
              +     done
              -     if [ "$STATUS" == "Succeeded" ]; then
              +     if [ "$STATUS" == "Succeeded" ]; then
              -         echo "Deployment $ID succeeded"
              +         echo "Deployment $ID succeeded"
              -     else
              +     else
              -         echo "Deployment $ID failed"
              +         echo "Deployment $ID failed"
              -         exit 1
              +         exit 1
                    fi
            EOT
          ~ content_base64sha256 = "2xIpgMQgPkuWFkt6mKIFVJ9EIyPgMblX7RlwLq+lJ6A=" -> (known after apply)
          ~ content_base64sha512 = "I5UV9rd/n8ksG9iVfbN4SnQ42aarxjHShi39AkVW/XxaKRfjuHv4OAvKRQ7GmYrfySvPaXw315oZYA81DjedvQ==" -> (known after apply)
          ~ content_md5          = "0520673090dfd2ce05cb6f588fd68806" -> (known after apply)
          ~ content_sha1         = "64052ff7b7e2398c9ab49615e5ea5caf6be76b0c" -> (known after apply)
          ~ content_sha256       = "db122980c4203e4b96164b7a98a205549f442323e031b957ed19702eafa527a0" -> (known after apply)
          ~ content_sha512       = "239515f6b77f9fc92c1bd8957db3784a7438d9a6abc631d2862dfd024556fd7c5a2917e3b87bf8380bca450ec6998adfc92bcf697c37d79a19600f350e379dbd" -> (known after apply)
          ~ id                   = "64052ff7b7e2398c9ab49615e5ea5caf6be76b0c" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*